ProgettoYii/basic/models/UtenteRegistrato.php

SELECT * FROM `Utente` WHERE `Email`='ciao@boh.com'
---
    public static function findByEmail($email)
    {
        return self::findOne(['Email'=>$email]);