ProgettoYii/basic/controllers/GestioneNotiziaController.php

SELECT DISTINCT `Count` FROM `Segnalazione` WHERE `Notizia` IS NULL
---
    public function actionSegnalazione()
    {
        $model=new Notizia();
        //prendo la variabile dal form
        $link_notizia=$model->Notizia;

        $segnalazione=new Segnalazione();

        $segnalazione->Notizia=$link_notizia;
        $segn=Segnalazione::find()->select('Count')->where(['Notizia' => $link_notizia])->distinct()->all();