ProgettoYii/basic/controllers/ProfiloController.php

SELECT EXISTS(SELECT * FROM `Fonte` WHERE `Fonte`.`ID`=44)
SELECT DISTINCT `ID` FROM `Fonte` WHERE `Fonte`='sky.it'
SELECT EXISTS(SELECT * FROM `Blocklist` WHERE (`Blocklist`.`Utente`=1) AND (`Blocklist`.`Fonte`=44))
SELECT `fonte`.`Fonte` FROM `Blocklist` LEFT JOIN `Utente` ON `Blocklist`.`Utente` = `Utente`.`ID` LEFT JOIN `Fonte` ON `Blocklist`.`Fonte` = `Fonte`.`ID`
SELECT `fonte`.`Fonte` FROM `Fonte` JOIN `Blocklist` ON Fonte.ID = Blocklist.Fonte JOIN `Utente` ON Blocklist.Utente = Utente.ID
---
    public function actionProfilo()
    {
        $email=Yii::$app->session->get('email');
        $domain=Yii::$app->session->get('domain');
        $nomeUtente=UtenteRegistrato::find()->select('Nome')->where(['Email'=> $email])->distinct()->all();

        $nome=$nomeUtente[0]->Nome;

        $blocklist=new Blocklist();

        $fonte=Fonte::find()->select('ID')->where(['Fonte' => $domain])->distinct()->all();
        $utente=UtenteRegistrato::find()->select('ID')->where(['Nome' => $nome])->distinct()->all();

        $fonteBloccata=$fonte[0]->ID;
        $utenteBlocca=$utente[0]->ID;

        $blocklist->Utente=$utenteBlocca;
        $blocklist->Fonte=$fonteBloccata;

        $blocklist->save();

        $query = (new \yii\db\Query())
        ->select('fonte.Fonte')
        ->from('Fonte')
        ->join('JOIN', 'Blocklist', 'Fonte.ID = Blocklist.Fonte')
        ->join('JOIN', 'Utente', 'Blocklist.Utente = Utente.ID');

        $lista = $query->all();